In [1]:
import os
import pandas as pd

os.chdir("/home/mediaworker/anaconda2/envs/pandas_playground/")

# syntax 2
# while reading from csv itself one can specify to parse_dates
df = pd.read_csv("datasets/employees.csv", parse_dates=["Start Date", "Last Login Time"])

df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")

df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-01 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-01 11:17:00,130590,11.858,False,Finance

In [4]:
# filters all unique values in 'Gender' column
df["Gender"].unique()

[Male, Female, NaN]
Categories (2, object): [Male, Female]

In [6]:
# filters all unique values in 'Team' column
df["Team"].unique()

array(['Marketing', nan, 'Finance', 'Client Services', 'Legal', 'Product',
       'Engineering', 'Business Development', 'Human Resources', 'Sales',
       'Distribution'], dtype=object)

In [8]:
# number of unique elements using python len()
len(df["Team"].unique())

11

In [11]:
# pandas' syntax to count unique value
# NOTE: This will not include NaN values
df["Team"].nunique()

10

In [12]:
# pandas' syntax to count unique value
# Note: This will count NaN value
df["Team"].nunique(dropna=False)

11